[
  {
    "order_index": 1,
    "text": "Что предпринимаем в первую очередь, чтобы удержать в стабильном состоянии атакуемую систему?",
    "options": [
      "Экстренно масштабировать приложение – увеличить скейл в 5 раз.",
      "Включить защиту на периметре: ограничить скорость запросов (rate limiting) и добавить капчу.",
      "Отключить подробное логирование, чтобы снизить нагрузку на диски и журналирование.",
      "Перезапустить базу данных (она тормозит систему)."
    ],
    "correct": "B"
  },
  {
    "order_index": 2,
    "text": "Как действуем, чтобы отличить ботов от людей?",
    "options": [
      "Ввести максимально жёсткий супер-Fingerprint fingerprint (сбор десятков параметров: Canvas, AudioContext, WebGL, установленные шрифты и т.п.) и банить навсегда все хосты, у кого которых цифровой отпечаток хоть немного вызывает малейшие подозрения.",
      "Запретить вход в систему всем пользователя, которые подключены через мобильный сети (3G/4G/5G).",
      "Перейти на risk-based подход: собирать минимально достаточные технические «отпечатки» + поведенческие факторы, вычислять риск-скоринг каждого клиента и при высоком риске включать точечные усиленные проверки (например, дополнительное подтверждение или капчу).",
      "Привязать лимиты запросов к неизменным атрибутам HTTP-запросов: например, анализировать User-Agent и Accept-Language каждого запроса и вводить ограничения на их основе."
    ],
    "correct": "C"
  },
  {
    "order_index": 3,
    "text": "Как разоблачить и нейтрализовать атаку, которая маскируется под легитимных пользователей?",
    "options": [
      "Применить геоблокировку: отключить весь трафик из иностранных регионов, оставить доступ только из РФ.",
      "Сопоставлять параметры TLS и последовательность HTTP-заголовков с поведением пользователей и их сессиями (first-party cookies/token). При малейших аномалиях включать Proof-of-Work капчи.",
      "Увеличить таймауты и очереди на бэкенде, чтобы каждый запрос дольше ждал ответа. Таким образом замедлить всех клиентов и попытаться переждать натиск.",
      "Ввести капчу для всех пользователей на каждый запрос/действие до конца атаки, чтобы отсеять автоматические скрипты."
    ],
    "correct": "B"
  }
]
